package Task2_arrays;

import java.util.Arrays;

public class arrays {

    public static void main(String[] args) {



  /*Необходимо реализовать класс в конструктор которого передается целочисленный массив.
    Необходимо реализовать в данном классе следующие функции:
    добавление элемента в массив (в конец и в определенную позицию)
    функцию вывод количества элементов в массиве
    удаление элемента массива по индексу
    изменения значения по его индексу
    функция вывода на экран всего массива
    функцию сортировки массива (по возрастанию и убыванию без изменения исходного массива)
    функцию вывода максимального/минимального элемента
    функцию заполнения массива одинаковыми элементами*/

        // Заполняем массив исходных данных
        int inp[] = {2, 4, 6, 7, 2, 3, 4, 9};

        System.out.println(inp);

    }

}
